[
  {
    "author_name": "Michael L",
    "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJEfmNhToUjtd-8CV66Sbgy07pMUqdfzXXY6S3wswg3MEiQiA=s1920-c-rp-mo-br100",
    "rating": 5,
    "date": "a week ago",
    "text": "They were extremely professional and prompt! We had some hiccups with our house since we had inherited a “fixer upper,” but Alex and his team worked with us to do more work than we had expected. They refinished our hardwood floors and replaced the old carpet with LVP. We truly appreciate this team’s flexibility and attention to detail!",
    "owner_response": null
  },
  {
    "author_name": "Cristian Gonzalez",
    "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJMn71Gi_AkToFCwD-NT75_1vdG_d2F0VjO8HkmvDsOKyrOfVA=s1920-c-rp-mo-br100",
    "rating": 5,
    "date": "2 weeks ago",
    "text": "We wanted to replace the floors in our townhome, but the prices and labor costs initially made us hesitate. Alex came out to give a free estimate, and his professionalism immediately put us at ease. His crew showed up on time and completed the entire job in just one day. The results exceeded our expectations and our floors look amazing! We couldn’t be happier and highly recommend Alex and his team.",
    "owner_response": null
  },
  {
    "author_name": "ItzMarvz",
    "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVJt-rUqMOXB8PYGGjbOQ1EKnozLohk4OZIwnaRNBdR42eONpoo=s1920-c-rp-mo-br100",
    "rating": 5,
    "date": "2 weeks ago",
    "text": "Alex Flooring & Carpentry LLC replaced our outdated cabinets and installed energy‑efficient windows in our Stafford townhouse. They offered 0 % financing for 12 months, which really helped our budget, and their crew was courteous and on time every day. The craftsmanship is top‑notch; our kitchen feels modern and bright, and the new windows have already lowered our energy bills.",
    "owner_response": null
  },
  {
    "author_name": "Adri mc",
    "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX0mvpWwWtqVz_5WHMLtiYq3PqY6OzMXZiuxPYBj0_BxDOJB9yFQQ=s1920-c-rp-mo-ba2-br100",
    "rating": 5,
    "date": "2 weeks ago",
    "text": "Alex Flooring & Carpentry did a great job installing luxury vinyl plank flooring and painting for us. The floors look beautiful, the paint was super clean around the edges, and everything was finished right on time. The crew was friendly, respectful of the house, and left everything neat. I’d definitely call them again for flooring or painting work.",
    "owner_response": null
  },
  {
    "author_name": "Jenny Montes",
    "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocImYwHMVFYfLwAZF35aAKGA8jG9fG_vDfYcz8ynKBYp9SDdUt43=s1920-c-rp-mo-br100",
    "rating": 5,
    "date": "3 weeks ago",
    "text": "I had Alex Flooring & Carpentry LLC install luxury vinyl plank floors in my house here in Dumfries, VA. They did an amazing job from start to finish — very detail-oriented, friendly, and respectful of our home. The new floors look beautiful and have completely transformed the space. Definitely the best flooring company in Dumfries.",
    "owner_response": null
  },
  {
    "author_name": "Alli & Nelly vlogs",
    "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW5m4_7rZWTcw8-1zZsz9mwIMXhpJzLtk3n1WgQEnHCdXgG2J6z=s1920-c-rp-mo-br100",
    "rating": 5,
    "date": "4 weeks ago",
    "text": "I had Alex Flooring & Carpentry come out to put new luxury vinyl plank flooring at my place in Dumfries. They did a solid job. The crew was friendly, showed up on time and got it done quicker than I expected. The floors look way better than what I had before. Not gonna lie, I was a little worried about the mess with a project like this, but they kept things pretty clean and checked in with me as they went. If you're in Dumfries and need new floor, I highly recommend Alex Flooring & Carpentry, I'd call them again for sure.",
    "owner_response": null
  },
  {
    "author_name": "Timothy Kim",
    "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJVyyjPEh0XBnd5dwUchnig_o_g0O8yqaNjE4IetmDaf-5bgA=s1920-c-rp-mo-br100",
    "rating": 5,
    "date": "10 months ago",
    "text": "Alex gave a very reasonable quote for replacing carpet with LVP. He helped me figure out what materials were needed to order and the quantities.\n\nHis team is very experienced and they quickly figured out how to solve a leveling issue when installing the planks.\n\nI plan on contacting them soon again to finish the upstairs portion of my house.",
    "owner_response": null
  },
  {
    "author_name": "Andreea Codeluppi",
    "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIWvY0MvFn_cGt4L9mOPzFPabvul9FvaemX_PLHl9MkELxRIg=s1920-c-rp-mo-br100",
    "rating": 5,
    "date": "a year ago",
    "text": "We worked with Alex Flooring to replace carpet with rubber flooring in our basement. We had a tough time finding a contractor who could put down rubber flooring, and we’re so grateful we found them. Alex, Remberto, and the team were awesome to work with - they were responsive, professional, detail oriented, and very thorough. They went above and beyond to help level the floor in certain spots and did an excellent job all around. It’s been two years and our floors have held up great! We highly recommend working with them.",
    "owner_response": null
  },
  {
    "author_name": "Daniel Arellano",
    "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIGvlvkwtugghdjwCXa9qBsREXIo-s4DDG74xMYN46Y8u_ytA=s1920-c-rp-mo-br100",
    "rating": 5,
    "date": "a year ago",
    "text": "Pleasure to work with. Project was completed from quote to finish in a professional and attentive manner. Super satisfied with process and end result. Look forward to working with Alex Flooring again and their team in the future. Definitely recommend!",
    "owner_response": null
  },
  {
    "author_name": "Michael Schultz",
    "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX85JGJDPijt8Pa9AieS5C0wOzGV9XFDilSFcTOL4AHli3RcWp-_g=s1920-c-rp-mo-ba3-br100",
    "rating": 5,
    "date": "a year ago",
    "text": "Alex was onsite in less than a week of my call.  His team was excellent.  Very professional and great carpenters.  Alex runs a great company and hires the best in the trade!  He installed my LVP flooring that I could not finish.",
    "owner_response": null
  },
  {
    "author_name": "Jason Zodda",
    "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKGrhve_dW17iF9kjLk0-60nH7RyOcFy2dFc_ZV4oYqfc8fKg=s1920-c-rp-mo-br100",
    "rating": 5,
    "date": "a year ago",
    "text": "Look no further. Alex and his team turned our old bathroom until a stunning room. He surpassed our expectations. His response to questions was faster than any other contractor and he genuinely appeared to want us satisfied. I couldn’t recommend him higher and look forward to hiring him again.",
    "owner_response": "Thank you for your kind words Jason, I look forward to working with you again in the future, cheers."
  },
  {
    "author_name": "Mike Karcic",
    "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJM3RjSwVDOGutDazi5_FsTVldiagvLOhrGqEKfjjK297vyFQ=s1920-c-rp-mo-br100",
    "rating": 5,
    "date": "a year ago",
    "text": "I needed to replace the carpet in my basement and was looking for luxury vinyl plank flooring. Alex Flooring quickly responded to my request and provided a reasonable quote. We scheduled the installation for the following week.  Before the installation, I was informed that the vinyl I had chosen for the stairs was on backorder for a month. To keep the project on schedule, they offered to use hardwood for the stairs at no additional cost!\n\nThe day of the install, the team arrived on time and was excellent throughout the process. They were friendly, kept me informed of their plans while prepping the floor and baseboards, and the final result is beautiful. The hardwood stairs are stunning and perfectly match the vinyl.\n\nWhen it was time to pay, I was pleasantly surprised to find my bill reduced since some of the prep work initially thought necessary was not needed. I highly recommend Alex Flooring for their honesty, excellent work, and great team.",
    "owner_response": null
  },
  {
    "author_name": "Lauren Nalls",
    "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWOq_ePOXRKEIVVSc9ANvXDwPWUn0uPe0e9QaCuu4VZAYjSEB46=s1920-c-rp-mo-br100",
    "rating": 5,
    "date": "a year ago",
    "text": "This crew was on time, worked hard, and did good work. Thank you!",
    "owner_response": "Thank you for the review Lauren, it was a pleasure working with you. "
  },
  {
    "author_name": "Maricel Gutiérrez",
    "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU7zns1_fxia0rA6Gi_asOUpwyoH8kvQ74hnp1vn4Y_tfJ2_uVj=s1920-c-rp-mo-br100",
    "rating": 5,
    "date": "a year ago",
    "text": "Alex Floor and Carpentry just finished replacing my carpeted floors and stairs with wood. It was very easy working with Alex. He is very knowledgeable and professional,  He responded very quickly to my request for an estimate, and the job was started very soon thereafter.  Alex’s employees did a beautiful and excellent job. I am very pleased with their skills, work ethic, courtesy, friendliness, and professionalism. Also, they meticulously cleaned the work area each day before leaving.\n\nI totally recommend Alex and his crew for house projects. I know I will not hesitate in using them again.",
    "owner_response": "Thank you so much for your kind words and for choosing us for your project. It was an absolute pleasure working with you."
  },
  {
    "author_name": "Michelle N.",
    "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUKSga8W2cnx_iQc6nwlvE7OUcfsrlu8Hr2cIF4cLeQIqqUI1HihA=s1920-c-rp-mo-ba4-br100",
    "rating": 5,
    "date": "2 years ago",
    "text": "Extremely professional installation of laminate flooring in basement. Was a two day job and the install crew showed up on time each day and did not need any oversight except answering a couple of my questions. They resolved an issue with an unleveled floor to my satisfaction. Perfect job estimation, written quote and final invoicing process.",
    "owner_response": "Thank you for your feedback! We're thrilled you're happy with the laminate flooring installation and look forward to serving you again."
  },
  {
    "author_name": "Monica Reyes",
    "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIY6bP_9rFQdn4OC6lVSQTZV4SZsq3WveKryVFUEJs5ozG9sw=s1920-c-rp-mo-ba2-br100",
    "rating": 5,
    "date": "2 years ago",
    "text": "The floors throughought my home were uneven, different heights, and had horrible transitions. The original part of my house was built in 1920 and the new addition was built in 2019 so a lot of contractors who came for estimates were intimidated with the project. They either told me it was impossible, it would be too expensive, or that the new floor will need to be added on top of the old floors… Not Alex! He knew exactly what to do, he understood my vision, and made it happen. Floor renovation took less time than what he projected and all of it was affordable. Alex and his workers are professional and responsive. Will definitely hire again for more projects!",
    "owner_response": "Thank you for your kind review! We're delighted to have been able to bring your vision to life and provide a smooth floor renovation experience. We appreciate your trust and look forward to serving you again in the future."
  },
  {
    "author_name": "Angela mattison",
    "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWe5gbrM2sNy2r2HlWQGnKcsvn_KNyIGPwgHZpcF3QsVBrNmsvr=s1920-c-rp-mo-ba3-br100",
    "rating": 5,
    "date": "2 years ago",
    "text": "Alex and his crew are exceptionally skilled professionals. They installed new bathroom tiles and a vanity in my home; the final products look amazing. If you're interested in getting flooring  & carpentry work done I'd highly recommend this company.",
    "owner_response": "Thank you for your wonderful review! We're thrilled that you're pleased with the new bathroom tiles and vanity we installed in your home. Our team at AF&C takes great pride in delivering exceptional craftsmanship and service. We appreciate your recommendation and look forward to assisting you with any future flooring and carpentry needs."
  },
  {
    "author_name": "Cody Mullins",
    "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXijQAD2L5T9qyPEUL1ZhN3nyZ9qxEGfTsuIMXfR4h1cmuA8uzn=s1920-c-rp-mo-ba4-br100",
    "rating": 2,
    "date": "2 years ago",
    "text": "Paid good money for installation of new stair treads and risers. Not only were the risers installed incorrectly, but they didn’t even nicely fill the old holes in the skirt board. They filled them but didn’t sand them down or paint, so now I’m left with a yellow mess to clean, sand, and paint on every stair.",
    "owner_response": null
  },
  {
    "author_name": "Cheryl Spangler",
    "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVednNSwRwhGngjf35-EIoKRFlpbHvHbVJTFD_Q7yyAQZWrPaGHVQ=s1920-c-rp-mo-ba3-br100",
    "rating": 5,
    "date": "3 years ago",
    "text": "I found Alex Flooring and Carpentry from an initial request via Thumbtack for flooring installation.  After (not kidding) 30 days of horrific experience finding a reliable contractor for my client looking to do a full renovation in order to sell her property for max price.  Many interviews, Many estimates, My seller deciding to manage the project herself  - we found Alex Flooring and they have been a blessing ever since. Easy to communicate with, knew what we wanted after only the first meeting, showed up on time, managed their team that worked on site to perfection. Always a full day of work and always cordial. They ended up getting all our work not just the flooring, but the complete home remodel including plumbing, electrical, floors, paint, repair and more.  The work is perfect with quality craft from absolutely every person involved on his team. I will recommend to clients, to family and to friends. This company will get all my business and personal referrals.",
    "owner_response": "Thank you so much for the glowing review! We're thrilled to have been a part of your client's project and appreciate your kind words. We're here for all your future projects and referrals!"
  },
  {
    "author_name": "Alyssa Neuman",
    "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKUu50ztQZoYQVZOpzxWiBUCJXnup9yeUYkgcNtDOTO1QT6vN4=s1920-c-rp-mo-br100",
    "rating": 5,
    "date": "3 years ago",
    "text": "I requested a quick turn around service for carpet and flooring replacement. Alex’s team did a great job. They were punctual, efficient and kept the area tidy as they completed their work. I would definitely use them again. Thank you Alex and Mauricio for a job well done!",
    "owner_response": "Thanks a bunch for the shoutout! We're glad we could meet your needs with our quick and efficient service. Looking forward to helping out again whenever you need us!"
  },
  {
    "author_name": "Kenton Comstock",
    "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIP0oS66iMKbhlxcGxarYlibCMa4IAAuD80l-MIHiduYUf3kv-B=s1920-c-rp-mo-ba4-br100",
    "rating": 5,
    "date": "3 years ago",
    "text": "Absolutely a great team. Alex Flooring and Carpentry recently installed 1.8k Sq ft of laminate flooring at one of our properties.  They finished product was exactly what we wanted and their work and communication was great. 100% recommended.",
    "owner_response": "Thanks for the stellar review! We're thrilled you're happy with the laminate flooring installation. It was a pleasure working with you, and we look forward to serving you again."
  },
  {
    "author_name": "Tawania Harvey",
    "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLIMG4Sccp4Wa2V5s75WzQPvOx60CFRar4TAE8AFLJgOclSBg=s1920-c-rp-mo-br100",
    "rating": 5,
    "date": "3 years ago",
    "text": "Alex and his guys are very punctual, detailed oriented and caters to the customer requests. Alex is very easy to work with and ensure the job is completed to the customer’s satisfaction. I highly recommend Alex and his guys for any of your carpentry projects. I give these guys a perfect 5 star.",
    "owner_response": "We're truly grateful for your fantastic feedback! It means a lot to hear about your positive experience with our team. Customer satisfaction is our top priority, and we're thrilled we could deliver on your carpentry project. Thanks for the glowing recommendation!"
  },
  {
    "author_name": "Richard Rubin",
    "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUlGYQ_Mv37cA64k31tIc49VTGFXMGiTLZhtYq3l0DeAdq3YQ=s1920-c-rp-mo-br100",
    "rating": 5,
    "date": "3 years ago",
    "text": "Alex was very responsive to my questions as I decided on a contractor to repair water damage to my laundry room.  I picked out the LVT for the floor from Lowes and he acquired it at a discount.  They moved washer, dryer and utility sink, repaired drywall, installed new baseboards and painted the walls in one day.   Then they replaced the flooring and transitions.  The work was done efficiently and cleanly and the result looks great.",
    "owner_response": "We're delighted to have been able to assist with your water damage repair project! It was our pleasure to provide prompt and efficient service, from answering your questions to completing the job in just one day. We're thrilled you're pleased with the results. Thanks for choosing us!"
  },
  {
    "author_name": "Faisal Sultan",
    "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV4fyrsg88AxlmvuLWBna0UoiSp_7PVT8xjBnp1n7EM56Y1al4T=s1920-c-rp-mo-ba2-br100",
    "rating": 5,
    "date": "3 years ago",
    "text": "The workmanship was excellent and they were extremely professional with everything. We love our new hardwood floors.\n\nAfter the work was completed Alex took it upon himself to make sure any of my concerns were addressed and took action to correct them.\n\nVery pleased and will be working with them again for future projects.",
    "owner_response": "We're thrilled to hear you're happy with your new hardwood floors and the overall service! Your satisfaction is our priority, and we appreciate your feedback. Looking forward to assisting with any future projects you may have. Thanks for choosing us!"
  },
  {
    "author_name": "Anita Greenlee",
    "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV1trbRa-hcSC3_kbKnwo85YRiljvHAyQoqEVg8ZAAqZqFJNWKFlg=s1920-c-rp-mo-br100",
    "rating": 5,
    "date": "3 years ago",
    "text": null,
    "owner_response": "Thank you for the review Anita!"
  },
  {
    "author_name": "Thomas Longridge",
    "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLHGvpxtBbb21GAkSo2EoJX5D82m3zSuN6kGEGHerzRUTYNlw=s1920-c-rp-mo-br100",
    "rating": 5,
    "date": "3 years ago",
    "text": null,
    "owner_response": "Thank you for the review Thomas!"
  },
  {
    "author_name": "Balinda Sphar",
    "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUp2crxUBWS66M-H-ZaOFinoNjRJ0Mpyz9X5FTrwqKz6SgQ2bZG=s1920-c-rp-mo-ba3-br100",
    "rating": 5,
    "date": "3 years ago",
    "text": "Great service and very responsive.",
    "owner_response": "It was a pleasure working with you Balinda, thank you for the review!"
  },
  {
    "author_name": "Alexander Taousakis",
    "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKDCL6jYdBswA-ALshsr8xQs5glFZJw_xV7kMdKIwFW69C6MA=s1920-c-rp-mo-br100",
    "rating": 5,
    "date": "3 years ago",
    "text": "I contracted with Alex Flooring to install LVP flooring in my entire basement, including two rooms having closets and stairs. Overall I am very happy with the result, and the attention to detail given. They took time to clean up and made very precise cuts. I would certainly recommend them.",
    "owner_response": "We're delighted to hear you're happy with the LVP flooring installation in your basement! Thank you for acknowledging our attention to detail and cleanliness. Your recommendation means a lot to us, and we look forward to serving you again in the future!"
  },
  {
    "author_name": "Bill L",
    "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL05nO27Fi25vTS2i5w2-g7sUrHwELQKZNQSEy_DqNXKuCbUw=s1920-c-rp-mo-br100",
    "rating": 5,
    "date": "3 years ago",
    "text": "They are time, clean up well, and do a great job on time. a #1 company to work with.\nBill L",
    "owner_response": "Thanks for the glowing feedback, Bill! We're glad you appreciate our punctuality, cleanliness, and quality work. It was a pleasure working with you, and we look forward to future projects together!"
  },
  {
    "author_name": "Suzanne Ludlum",
    "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVU_Z5wIFNCBKSNl9i2GoAx7eqIDcRrbgcac-7NftIWD-GZmi0=s1920-c-rp-mo-br100",
    "rating": 5,
    "date": "Edited 3 years ago",
    "text": "Alex and his crew did a fantastic job on our kitchen remodel.  He stayed in contact with us on a regular basis, let us know when workers would be there and what they would be doing, and he was onsite often to oversee the job.  We would hire Alex and his company back any time!",
    "owner_response": "Thanks for the wonderful feedback! We're thrilled to hear you're happy with your kitchen remodel. Communication and oversight are key to us, so we're glad you appreciated our regular updates and on-site presence. We'd be more than happy to work with you again anytime!"
  },
  {
    "author_name": "Lisa Bartley",
    "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVHn0-0Jv9hir2pvVURyapLwI4OuBx5PV-0uFz-hXKAvdr3Z_2A=s1920-c-rp-mo-ba2-br100",
    "rating": 5,
    "date": "3 years ago",
    "text": "This was my first time using Alex Flooring,they came recommended by a friend.  I was happy with the work that was provided and most certainly will use them again and recommend them to my friends and associates.",
    "owner_response": "Thank you for choosing us and for your kind words. We're thrilled that you're satisfied with our work and look forward to assisting you again in the future. Your recommendations mean the world to us!"
  },
  {
    "author_name": "George Reither",
    "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLh-wCmn_mr9kyLL_57UXfc3t24mSS_8xBJUHxIh_RYsJ-_Lw=s1920-c-rp-mo-ba3-br100",
    "rating": 5,
    "date": "3 years ago",
    "text": "Remberto was a pleasure to work with. I needed work done, basically last minute, and he was able to accommodate. The workers he sent over were polite and professional and they did a great job installing the flooring that I picked out. I told them what flooring material I wanted and they picked it up and installed. His prices were very reasonable also, cheaper than a couple other places quoted, but not slacking on the quality. I would recommend them. Thank you.",
    "owner_response": "We're thrilled to have been able to accommodate your last-minute needs! Thank you for your kind words about our team's professionalism and the quality of our work. We strive to provide excellent service at reasonable prices. Your recommendation means a lot to us. Thanks again!"
  },
  {
    "author_name": "Krystal B",
    "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU5TmS_MBPocJfZZieshpPozB0n1zV5OkGSTf9RgYNEduYjRD8=s1920-c-rp-mo-br100",
    "rating": 5,
    "date": "4 years ago",
    "text": null,
    "owner_response": "Thank you for the 5-star rating! We're glad you were satisfied with our service. If you ever have any feedback or questions in the future, feel free to reach out. We appreciate your support!"
  },
  {
    "author_name": "Briauna Chase",
    "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVSTGblyC90BRgRmauIvbMBz35y7vFfc5dU7O_CL-7kOlS6MHfi=s1920-c-rp-mo-br100",
    "rating": 5,
    "date": "4 years ago",
    "text": "Alex and his crew are AMAZING! Such kinds employee’s, efficient, and hard working! I decided to remodel my floors myself but got a bit ahead of myself. Alex and his workers came in and repaired where I went wrong, and finished up the job for me nice and neat! We’re in love!",
    "owner_response": null
  },
  {
    "author_name": "Paul Aubin",
    "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWzUyxqlecSVK28LjHdBwnNGo4bm8S8lJk6s3U3epMSQGSUY5KH=s1920-c-rp-mo-ba4-br100",
    "rating": 5,
    "date": "4 years ago",
    "text": "Alex, Remberto, and their entire team did an amazing job.\n\nEven before the install date, Remberto and Alex were great.  Alex came by our house 2 times to review details, and Remberto was great at updating the contract and estimates as things came up.\n\nOnce the work began, their workers were amazing.\n\nThey showed up every day on time, worked hard all day, even skipping lunch.  They worked from 8:30 AM to 6:30 PM for 5 days straight.\n\nThey wore their masks the entire time as well.\n\nThe quality of work done was great, and their price was great as well.\n\nI would definitely recommend them to others.",
    "owner_response": "Thank you so much for the stellar 5-star rating! We're thrilled to hear you were satisfied with our service. If there's anything else we can do for you in the future, just let us know. Your support means a lot to us!"
  },
  {
    "author_name": "Julia Herrera",
    "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIVaBLN_r-WXVgsHynZgkaAYWtr9R7WPD0V4SRFEirJfVta1A=s1920-c-rp-mo-br100",
    "rating": 5,
    "date": "4 years ago",
    "text": "Alex and his team were on time, worked hard, and got the job done efficiently. They installed my floor with beautiful results and at a fair price. I will not hesitate to use them again for my next project.",
    "owner_response": "Thank you for the wonderful feedback! We're delighted that you're pleased with our work and efficiency. It was a pleasure working with you, and we're looking forward to helping with your next project whenever you're ready. Don't hesitate to reach out if you need anything in the future!"
  },
  {
    "author_name": "Tim Craig",
    "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJjrMWVD7X4Hy1qNLK7zFDHIoyaxalXV8SHUBiDBBYlIOYDIw=s1920-c-rp-mo-br100",
    "rating": 5,
    "date": "4 years ago",
    "text": "I needed to get my downstairs flooring replaced. Alex Flooring & Carpentry was recommended to me by my neighbor. Alex provided an accurate quote and met me at the Woodbridge Floor & Decor store to ensure that the correct hardwood was ordered. Then he met me at the Lowe's in Woodbridge to make sure the correct tile was ordered. All the work was performed as scheduled and for the price that I was quoted and it looked fantastic. I was very happy with the outcome. I was so happy with the work that when I was ready to replace the flooring upstairs, I didn't think about calling anyone else. I just called Alex. Once again the work was completed on time and for the price quoted.",
    "owner_response": "We're thrilled to hear about your positive experience with us! Thank you for trusting us with your flooring needs and for your kind words. Ensuring the right materials were ordered was a priority for us, and we're glad it paid off with fantastic results. We're delighted to have been your go-to for both your downstairs and upstairs flooring projects. Looking forward to any future projects you may have. Thanks again for choosing us!"
  },
  {
    "author_name": "Jeremy Yok",
    "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocInhyNEwrLU5pAlx1q-phVKWfe7BrEk5Ze8-WxoNSbn4uroUA=s1920-c-rp-mo-br100",
    "rating": 5,
    "date": "4 years ago",
    "text": "Responsive, punctual, and priced fairly.  Replaced ~1600 sqft of carpet in 6 rooms in 3 days.",
    "owner_response": "Thanks for the great feedback! We're glad you appreciated our responsiveness, punctuality, and fair pricing. Completing the project efficiently is always our goal. If you ever need our services again, just let us know!"
  },
  {
    "author_name": "Briauna Chase",
    "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIrl4aR7s45amDpAZltlRtjPDaKwRortlx6MRvQJPLmS9klkQ=s1920-c-rp-mo-br100",
    "rating": 5,
    "date": "4 years ago",
    "text": "My husband and I found Alex on thumbtack. We were wanting all of our carpet replaced with laminate flooring. The customer service of this company is through the roof amazing, and I will hands down always recommend them! Loved every moment of our experience!",
    "owner_response": null
  },
  {
    "author_name": "Ashley Layton",
    "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUjfhyieg3xFJuuf6D0UQCb6dtCnulBqVlxZK_EtB8vi7DcN14R=s1920-c-rp-mo-ba4-br100",
    "rating": 5,
    "date": "4 years ago",
    "text": "I have worked with this company for years on many projects and they have always been very responsive and reliable. I look forward to continuing to do business with them in the future!",
    "owner_response": "Thank you so much for your ongoing support and loyalty! We're delighted to hear about your positive experiences with us over the years. We're committed to maintaining our responsiveness and reliability for all your future projects. Looking forward to many more successful collaborations ahead"
  },
  {
    "author_name": "Lindsay",
    "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIwzfg1DTOmCGjO7duJDqCNkQpXKFQuEztHWNPucoK_VwcsBbA=s1920-c-rp-mo-br100",
    "rating": 5,
    "date": "4 years ago",
    "text": "Guys came in on such short notice to install our floors! Did a great job and they look great. We’re completed sooner than expected as well. Would use again",
    "owner_response": "Thanks, Lindsay! We're thrilled we could accommodate your needs on short notice and deliver results that exceeded expectations. We appreciate your feedback and look forward to any future opportunities to work together again!"
  }
]